{
  "main": {
    "name": "Crystal Chen",
    "description": "I am a full stack developer who studied Computer Science with a focus on software principles and design at Brown University.",
    "github": "https://github.com/hCrystalChen",
    "linkedin": "https://www.linkedin.com/in/crystal-chen-121689162",
    "resumedownload": "https://drive.google.com/file/d/1KbgCZKqWNqmDUSmqTn0Zfsm8VCnlvxfP/view?usp=sharing"
  },
  "resume": {
    "skillmessage": "",
    "education": [
      {
        "school": "Brown University",
        "degree": "B.Sc. in Computer Science",
        "graduated": "May 2020",
        "description": "Originally an Applied Mathematics major, I discovered my passion for software engineering during an intro level computer science course and have since explored various areas in the field through courses, projects, and research experiences."
      }
    ],
    "work": [
      {
        "company": "Dash | Brown University Graphics Lab",
        "title": "Full Stack Research Intern",
        "years": "June 2017 - September 2018",
        "description": "Collaborated with over 10 developers to develope a pen and touch digital whiteboard application for collecting, creating, and organizing document-based workflows.",
        "website": "https://cs.brown.edu/research/ptc/#/project/dash"
      },
      {
        "company": "NuSys | Brown University Graphics Lab",
        "title": "Front End Research Intern",
        "years": "February 2017 - June 2017",
        "description": "Worked with a team of undergraduate and graduate developers to develope a collaborative tool for powerful multimedia annotation on an unbounded workspace in C# and XAML.",
        "website": "https://cs.brown.edu/research/ptc/#/project/nusys"
      }
    ],
    "skills": [
      {
        "name": "Java",
        "level": "80%",
        "type": "backend"
      },
      {
        "name": "C#",
        "level": "70%",
        "type": "backend"
      },
      {
        "name": "Python",
        "level": "60%",
        "type": "backend"
      },
      {
        "name": "C++",
        "level": "55%",
        "type": "backend"
      },
      {
        "name": "JavaScript/React",
        "level": "60%",
        "type": "frontend"
      },
      {
        "name": "HTML/CSS",
        "level": "60%",
        "type": "frontend"
      },
      {
        "name": "Git",
        "level": "70%",
        "type": "other"
      }
    ]
  },
  "courses": {
    "projects": [
      {
        "title": "CS1230 Intro to Computer Graphics",
        "category": "Explored the fundamental concepts in 2D and 3D computer graphics in-depth. Topics covered included 3D modeling, viewing and rendering, geometric transformations and 2D raster graphics techniques, such as scan conversion, simple image processing and user interface design. OpenGL, C++ and shader programming on the GPU were used throughout the course.",
        "image": "graphics_filtered.png",
        "work": [
          {
            "title": "Filters",
            "description": "Implemented various image manipulation operations such as edge-detection, blurring, image scaling, and sharpening, which served as an introduction to image processing and anti-aliasing.",
            "image": "filters.jpg"
          },
          {
            "title": "Shapes",
            "description": "Implemented object tessellations by using triangles to construct 3D objects such as cubes, cylinders, spheres, and cones. ",
            "image": "shapes.jpg"
          },
          {
            "title": "Ray Tracer",
            "description": "Implemented a ray tracer to render realistic pictures of geometric objects by using available information about lighting and optical effects like light reflection and refraction. Implementation supports reflections, texture mapping, shadows, specular highlights, directional lighting, and light fall-off (attenuation).",
            "image": "ray.jpg"
          },
          {
            "title": "3D Terrains in VR",
            "description": "As our final project for the class, my teammates and I created a realistic 3D landscape with procedurally-generated terrains, waters, and L-systems trees viewable throw a VR headset. Texture mapping and a Skybox were also added to the implementation to increase user immersion. (Note: Image shown below is a prototype of the scene, rendering the actual scene in VR requires hardware that I do not currently own.)",
            "image": "terrains.jpg"
          }
        ]
      },
      {
        "title": "CS1320 Creating Modern Web and Mobile Applications",
        "category": "Took a holistic look at the process of developing web and mobile applications to gain experience of the most-used technologies and development practices.",
        "image": "web_filtered.jpg",
        "work": [
          {
            "title": "Realtime Chatroom",
            "description": "Implemented a Node.js web application using HTML, CSS, JavaSript, and socket.io to allow users to join unique chatrooms and engage in realtime public or private conversations with anyone in any active chatrooms. The application also features functinality to share the current chatroom, idle-time detection, live typing notifcations, and unread message counts and notifications for private conversations.",
            "image": "realtime.jpg"
          },
          {
            "title": "Health Survey App",
            "description": "My teammates and I created an Android app for the Watson Institue of Brown University to collect sexual-health data of students at the University of Zambia using React Native and the Qualtrics API.",
            "image": "health_survey_app.jpg"
          }
        ]
      },
      {
        "title": "CS1300 User Interfaces and User Experiences",
        "category": "Learned when to use different interfaces, how to model and represent user interaction, how to elicit requirements and feedback from users, as well as the principles of user experience design, methods for designing and prototyping interfaces, and user interface evaluation.",
        "image": "search_filtered.jpg",
        "work": [
          {
            "title": "A/B Testing and User Testing",
            "description": "Collected and analyzed user behavior through quantitative data by conducting A/B testing and qualitative data by conducting user testing.",
            "image": "ab_testing_short.png"
          },
          {
            "title": "Personas and Storyboarding",
            "description": "Conducted contexual inquiries and observed how users interact with an interface (in this case, Brown's print services interface) to create personas that are representative of the overarching trends observed and storyboard their experiences.",
            "image": "storyboard.png"
          },
          {
            "title": "Iterative Redesign",
            "description": "Redesigned the interface of an emerging startup iteratively and conducted eye tracking sessions with potential users on the final prototype to understand how they engage with the interface.",
            "image": "iterative_redesign.png"
          }
        ]
      },
      {
        "title": "CS0150 Intro to Object-Oriented Programming",
        "category": "Learned how to write modular and reusable code and applied knowledge of object-oriented design to create interactive programs with graphical user interfaces using Java and the JavaFX graphics library.",
        "image": "intro_filtered.jpg",
        "work": [
          {
            "title": "Tetris",
            "description": "",
            "image": "tetris.jpg"
          },
          {
            "title": "Doodle Jump",
            "description": "",
            "image": "doodle.jpg"
          },
          {
            "title": "Pacman",
            "description": "Implemented with BFS.",
            "image": "pacman.jpg"
          }
        ]
      },
      {
        "title": "CS0160 Intro to Alogrithms and Data Structures",
        "category": "Learned, analyzed and applied algorithms and data structures for sorting, searching, graph problems and geometric problems to develope problem solving skills that are relevant to most areas of Computer Science.",
        "image": "data_filtered.png",
        "work": [
          {
            "title": "Seamcarve",
            "description": "Calculated pixel importance and implemented lowest cost seam finding using dynamic programming for image resizing.",
            "image": "seamcarve.png"
          },
          {
            "title": "Heap",
            "description": "Implemented a heap, which is an implementation of a priority queue, with a binary tree.",
            "image": "heap.png"
          },
          {
            "title": "Graph",
            "description": "Implemented a graph, as well as the Kruskal and Prim-Jarnik algorithms for finding minimum spanning forests (MSFs) of a graph.",
            "image": "graph.png"
          }
        ]
      },
      {
        "title": "CS0330 Intro to Computer Systems",
        "category": "Covered the organization of computer systems (in terms of storage units, caches, processors, and I/O controllers) and was introduced to assembly-language and C language programming. Course work included system-level programming on Linux systems, as well as multithreaded programming with POSIX threads in C.",
        "image": "systems_filtered.png",
        "work": [
          {
            "title": "Shell",
            "description": "Wrote a simple shell in C that parses command line input to execute the corresponding programs or built-in shell commands. The shell supports input/output file redirection and basic job control by running some processes in the background and managing processes with signal forwarding.",
            "image": null
          },
          {
            "title": "Malloc",
            "description": "Created a first-fit explicit-free-list dynamic memory allocator for C programs, i.e. malloc(), free() and realloc() routines as well as a heap-checking function (mm_check_heap()) that prints out the state of the heap. ",
            "image": null
          },
          {
            "title": "Buffer",
            "description": "Developed a detailed understanding of x86-64 calling conventions and stack organization by applying a series of buffer overflow attacks on an executable file.",
            "image": null
          },
          {
            "title": "Database",
            "description": "Implemented a database with search, add and remove functionalities and a server to manage this database of key value pairs over a network. Since the server was implemented to handle multiple clients, the database was also made thread-safe with fine-grained locking and built to support client cancellation.",
            "image": null
          }
        ]
      }
    ]
  }
}
